Tekla.Structures.Model.Weld.WeldPositionEnum
The weld position.

Tekla.Structures.Model.Weld.WeldPositionEnum.WELD_POSITION_PLUS_X
The position +x.

Tekla.Structures.Model.Weld.WeldPositionEnum.WELD_POSITION_MINUS_X
The position -x.

Tekla.Structures.Model.Weld.WeldPositionEnum.WELD_POSITION_PLUS_Y
The position +y.

Tekla.Structures.Model.Weld.WeldPositionEnum.WELD_POSITION_MINUS_Y
The position -y.

Tekla.Structures.Model.Weld.WeldPositionEnum.WELD_POSITION_PLUS_Z
The position +z.

Tekla.Structures.Model.Weld.WeldPositionEnum.WELD_POSITION_MINUS_Z
The position -z.